---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
DisableAnalyticalModelCB Properties
DisableAnalyticalModelCB Class See Also Send Feedback
---

The DisableAnalyticalModelCB type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from FailureResolution.) |

# See Also

DisableAnalyticalModelCB Class

Autodesk.Revit.DB Namespace